clear all
clc
k1=[1,2,3,4,5,6;1,2,3,4,5,6;1,2,3,4,5,6;1,2,3,4,5,6;1,2,3,4,5,6;1,2,3,4,5,6;]

k2=[1,2,3,4,5,6;1,2,3,4,5,6;1,2,3,4,5,6;1,2,3,4,5,6;1,2,3,4,5,6;1,2,3,4,5,6;]
mm1=[1,2,3]
mm2=[1,3,4]
KK=zeros(8,8)

i=mm1(1,1) %单元1节点的序号（逆时针）
j=mm1(1,2)  %单元2节点的序号（逆时针）
k=mm1(1,3)  %单元3节点的序号（逆时针）

Dof(1)=2*i-1
Dof(2)=2*i
Dof(3)=2*j-1
Dof(4)=2*j
Dof(5)=2*k-1
Dof(6)=2*k

for n1=1:6
    for n2=1:6
        KK(Dof(n1),Dof(n2))=KK(Dof(n1),Dof(n2))+k1(n1,n2)
    end
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

i=mm2(1,1) %单元1节点的序号（逆时针）
j=mm2(1,2)  %单元2节点的序号（逆时针）
k=mm2(1,3)  %单元3节点的序号（逆时针）

Dof(1)=2*i-1
Dof(2)=2*i
Dof(3)=2*j-1
Dof(4)=2*j
Dof(5)=2*k-1
Dof(6)=2*k

for n1=1:6
    for n2=1:6
        KK(Dof(n1),Dof(n2))=KK(Dof(n1),Dof(n2))+k2(n1,n2)
    end
end



z=KK;

% K=jiahetri(K,k2,mm2)