function [z]=jiaherect_heat(H,heat,mm)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%该函数进行单元刚度矩阵的组装
%%%%输入:单元刚度矩阵k，单元的节点编号i,j,k(ME(i,:)),
%%%%单位节点维数n
%%%%输出:整体刚度矩阵KK
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
n=8;
i=mm(1,1);  %单元1节点的序号（逆时针）
j=mm(1,2);  %单元2节点的序号（逆时针）
p=mm(1,3);  %单元3节点的序号（逆时针）
l=mm(1,4);  %单元3节点的序号（逆时针）

Dof(1)=2*i-1;
Dof(2)=2*i;
Dof(3)=2*j-1;
Dof(4)=2*j;
Dof(5)=2*p-1;
Dof(6)=2*p;
Dof(7)=2*l-1;
Dof(8)=2*l;

for n1=1:n
        H(Dof(n1),1)=H(Dof(n1),1)+heat(n1,1);
end
z=H;
end